# !
'''
Задание 1.
Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и строк
и сохраните в переменные, выведите на экран.
'''



# выводим одно слово
print('Hello!')

# выводим несколько слов
print('Hello, world!')

# выводим любой набор символов
print('dafagd $ gdf fglhjp ljk;lj')

# выводим целое число
print(100)

# выводим число с плавающей точкой
print(90.89)

# выводим истину
print(True)

# выводим ложь
print(False)

# выводим None
print(None)

age = input('Сколько Вам лет?: ')
print(age)

name = input('Введите Ваше имя: ')
second_name = input('Введите Вашу фамилию: ')
print("Здравствуйте, " + second_name + " " + name)

